{"Blog/software_recommendations":{"title":"Software Recommendations","links":[],"tags":["Software"],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNamePurposeObsidianNote-takingdigiKamPhoto managementyt-dlpYouTube downloaderAnkiSpaced repetition or flashcardsZoteroCitations managerSuper ProductivityTime-tracking softwareBitwardenPassword managementSyncthingFile synchronizationJellyfinMedia serverqBittorrentTorrentingLogseqOutlinerVeraCryptDisk encryption"},"Blog/the_categorical_imperative":{"title":"The Categorical Imperative","links":[],"tags":["Philosophy"],"content":"Sources\n\nFrancis Evangelista, Napoleon Mabaquiao, Anvil Publishing, “Ethics: Theories and Applications” - 2020\n\nCategorical Imperative\nImmanuel Kant put forward the most prominent deontological theory called the categorical imperative. Unlike the other deontological theories, it asserts that moral laws should only come from reason and not from any external authority (e.g., God, and nature).\nIt claims that generous actions with moral worth are not prompted by natural inclinations. Moral principles would not be consistent if it was founded on human inclinations, desires, or nature—because these things vary for each person; thus, would entail that moral standards would also be different per individual. Moreover, the theory views morality as a necessity that does not require other things for it to exist; in other words, it is not contingent.\n\n\n                  \n                  Quote\n                  \n                \nWe cannot too much or too often repeat our warning against this lax and even mean habit of thought which seeks for its principle amongst empirical motives and laws; for human reason in its weariness is glad to rest on this pillow and in a dream of sweet illusions it substitutes for morality a bastard patched up from limbs of various derivation, which looks like anything one chooses to see in it; only not like a virtue to one who has once beheld her in her true form\n— Kant, 1965\n\nKant contends that our rational will (or reason) solely underlies morality, independent of empirical observation. Consequently, he claims that our moral knowledge comes before human experience, and as such, moral reasoning is based on reason alone—even without even the aid of human experience.\nThe Good Will\nKant believes that morality is necessary, absolute, and universal; therefore, its value is not derived from nonmoral goods like happiness (it is inherently valuable).\n\n\n                  \n                  Quote\n                  \n                \n…this Good will should wholly lack power to accomplish its purpose, if with its greatest efforts it should yet achieve nothing, and there should remain only the Good Will,… then, like a jewel, it would still shine by its own light, as a thing which has its whole value in itself. Its usefulness or fruitfulness can neither add to nor take away anything from this value\n— Kant, 1965\n\nFor Kant, the highest good is one that is intrinsically valuable—which he referred to as moral good—as opposed to the derived nonmoral good found in utilitarianism.\nBesides this, he also claimed that good will is the only thing good in itself.1 For this reason, he argued that the only good actions are the ones performed with a good will: if a person does a generous action for a motive besides moral duty, they are acting with the wrong motive.\nThe idea that good will is the only thing good in itself implies that other virtues—such as happiness, knowledge, and power (nonmoral goods)—are only instrumental goods, thereby having the potential to be evil when used by an evil will. As a result, only good will is essential in determining whether a particular action is morally valuable or not.\nActing from Duty\nAccording to Kant, for an action to be good, it has to come with a good will; in other words, it is done for the right reason. This means that a good person is one whose actions are motivated by their duties or their respect for the moral law itself. Good people act from duty and not in accord with duty; they do not do good because it is convenient to do so, rather, they do it because it is their duty.\nActing from duty implies that it is not done due to desires, feelings, or natural inclinations. As such, good deeds instigated by feelings of pity will grant no moral points. Kant stresses that if the feelings or desire disappear, the actions will as well; thus, if we govern ourselves through our reason, we control our desires and foster the nobler parts of ourselves.\nIn order to determine what our moral duties are, Kant formulated the categorical imperative.\nThe Categorical Imperative\nThrough nonempirical reasoning, we can arrive at absolute moral truth and discover our moral duties. Hence, we do not need to use empirical data to determine which actions are right and which ones are not.\nMoral duties can be translated into the language of imperatives or commands; as a consequence, we can say that they have imperative force. Kant categorized these imperatives into two types:\n\nHypothetical imperative (or conditional imperative) - possesses the formula:\n\nIf you want X, then do Y\n\n\nCategorical imperative (or unconditional imperative) - possesses the formula:\n\nDo Y\n\n\n\nOur moral duties are categorized as categorical imperatives; hence, we are required to accomplish them regardless of the consequences or its effects on our desires.\n\n\n                  \n                  Three ways in which the categorical imperative may be formulated \n                  \n                \nThere are three different general principles that explain the conditions an acceptable moral rule should meet:\n\nPrinciple of Universal Law\nPrinciple of Ends\nPrinciple of Autonomy\n\n\nRules Must Be Universal\n\nAct only on that maxim whereby thou canst at the same time will that it should become a universal law.\n\nThe Principle of Universal Law contends that moral rules should be impartial and universal. Therefore, a valid maxim (or general rule of conduct) is suitable for everyone to live by.\nThis principle highlights the importance of acting rationally; instead of just focusing on one’s own self-interest, they also view it from the perspectives of others. If a rule is not consistent—like when it does not equally apply to everyone or when it can be broken when it suits our immediate interests—it is meaningless.\nBesides this, Kant believed that moral judgments should be logically consistent and free from internal contradictions.\n\n\n                  \n                  Summary\n                  \n                \nThree important things to note in this principle according to Wall (2003):\n\nThe categorical imperative does not provide us with a list of concrete rules, instead it provides us conditions that any rule must satisfy. In terms of form, all moral rules should be universalizable.\nMorality should be impartial, meaning that it treats everyone equally.\nNo exceptions can be applied to the universalizable moral maxims (to prevent any contradictions).\n\n\nTreating Persons as Ends\n\nSo act as to treat humanity, whether in your person or in that of any other, in every case as an end and never as merely a means.\n\nThe Principle of Ends, also known as the Principle of Respect for Person, is the second formulation of the categorical imperative. This formulation emphasizes humanity’s inherent value due to their sheer possession of rationality. Even those who do not act rationally are still unconditionally valuable because of their capacity of achieving a good moral character. 2\nBecause rational beings are intrinsically valuable, Kant believes that it is immoral to use them as merely means to an end—it violates their inherent worth. Even if using them will benefit society, it is still not morally permissible to do so because it disrespects their dignity, rights, and autonomy—we are treating them like objects (things that only have instrumental worth).\n\n\n                  \n                  Note\n                  \n                \n\nKant is not necessarily saying that treating people as means is wrong, but that we should we value people’s consent or autonomy. Thus, we can use others as means if they permit it.\nBesides treating them as means, we ought to also treat them as an end; this entails that we respect their autonomy, rights, and dignity.\n\n\nThis principle does not only apply to others but also ourselves. Kant stresses the moral significance of respecting one’s own rights and dignity. For this reason, one cannot justify being a slave by stating that they consented to it because it violates their dignity.\nThe Will as Universal Lawgiver\n\nSo act as if you were always through your maxims a law-making member of the kingdom of ends 3\n\nThe third formulation, also known as the Principle of Autonomy, claims that we only act in good will when we have convinced ourselves that the moral law that governs us are our duties. It implies that we follow a rule not because of any external authority but because our reasoning ability tells us to. Nonetheless, we should ensure that the personal maxims we legislate are both universalizable and respectful towards people’s dignity and rights.\nThis principle underscores the value of choosing our own moral rules—we live by our moral laws because of our sheer respect for them. Doing so will allow us to live true to our nature as rational beings. 4\nThe opposite of this principle is heteronomy; it characterizes actions which are motivated by external authority (e.g., religion, the state, and culture).\nFollowing this principle entails that we cannot impose our morals into others because we have to recognize their autonomy as rational persons.\nCriticisms\n\nIt cannot resolve moral dilemmas. It is incapable of determining which duty should override the other because it views moral rules as absolute and exceptionless.\nIt is too strict and unrealistic. The theory does not see the moral worth in actions not motivated by duty but feelings or natural inclinations.\nIt has an incomplete view of humans. Critics say that humans are not purely composed of reason, but also consists of emotions and desires; thus, it should not be ignored when discussing our nature.\nIts view on moral personhood is biased towards mentally-healthy humans. It only considers a being as a person when they are capable of rational judgment and have a will to adhere to moral principles. This implies that mentally-impaired people have no moral standing, and thereby have no moral rights. In addition, it can disregard the moral rights of some animals.\n\nFootnotes\n\n\nWill, in this context, pertains to intention or motive. ↩\n\n\nRationality is valuable because it underlies morality. ↩\n\n\nThe kingdom of ends pertains to the web of all rational beings that are tied by shared moral maxims. ↩\n\n\nDidn’t Aquinas say the same thing when discussing the natural law theory? (rationality is both in our nature and purpose as humans, that’s why we follow moral principles) ↩\n\n\n"},"Research/minimum_wage_in_the_philippines":{"title":"Minimum Wage in the Philippines","links":[],"tags":["Economy"],"content":"\n\n                  \n                  Warning\n                  \n                \nThis is temporarily abandoned.\nWill add more info when I need to write more papers about it.\n\nSources\n\n\nCordero, T. (2024, April 12). Current minimum wage still not enough to meet family needs—IBON. GMA News. www.gmanetwork.com/news/money/economy/903491/current-minimum-wage-still-not-enough-to-meet-family-needs-ibon/story/\n\n\nHa, C. (2024, January 23). Minimum wage in the Philippines not sufficient for employees. hrmasia. hrmasia.com/minimum-wage-in-the-philippines-not-meeting-basic-needs/\n\n\nBackground\n\nAs of March 2024, IBON Foundation claims that the national average daily minimum wage (440 PHP) is not enough to cover food and non-food costs of the typical family of five’s needs\n\nthe family living wage—computed using the National Wages and Productivity Commission’s (NWPC) minimum wage data and March 2024 inflation data from the Philippine Statistics Authority—averaged at P1,207, resulting in a national wage gap of P762.\n\n\nAn analysis from Picodi Philippines found that the minimum wage in the country fails to keep up with the rising food prices, suggesting that some Filipinos may not be able to live off the amount earned from work.\n"},"School/2024_dlsu_medical_requirements":{"title":"2024 DLSU Medical Requirements","links":[],"tags":[],"content":"Drug Testing\n\n\n                  \n                  Info\n                  \n                \nDetailed process\n\n\n\n                  \n                  Steps \n                  \n                \n\nSecure and verify the drug testing consent form (if not yet submitted).\nSchedule an appointment through MLS.\nCheck if you received a confirmation email.\nPresent an ID and a screenshot of the confirmation email onsite during the appointment.\n\n\nConsent Form Verification Dates\n\nJune 13\nJune 14\nJune 18\nJune 19\n\nAppointment Date\n02-17 July 2024\nResults\nResults will be released at the Health Services Office (HSO) Enrique Razon Sports Center Clinic and shall be made available on 04 October 2024. Drug test results not claimed by 04 December 2024 shall be forwarded to the drug testing provider’s office where students may claim their results thereafter. The map and address can be viewed here.\nPeriodic Health Examination (PHex)\n\n\n                  \n                  Info\n                  \n                \nDetailed process\n\n\n\n                  \n                  Steps \n                  \n                \n\nDownload the forms.\nChoose an accredited clinic.\nPresent the form to the clinic.\nSubmit the filled-out forms at Waldo Perfecto Seminar Room, Ground Floor, Br. Connon Hall, Monday to Saturday, from 8:00 am to 4:00 pm—no later than 27 July 2024.\n\n\nForms to Print\n\nMedical examination form\nDental examination form\n"},"School/Assignment-Preparation/authenticity_scale":{"title":"Authenticity Scale","links":[],"tags":["Psychology"],"content":"Authenticity Scale\nSources\n\nAlex Mathew Wood, P. Alex Linley, John Maltby, Journal of Counseling Psychology, “The Authentic Personality: A Theoretical and Empirical Conceptualization and the Development of the Authenticity Scale” - 2008-07\nBen G. Yacobi, Philosophy Now, “The Limits of Authenticity” - 2012\n\nAssignment Instructions\n\nAnswer the authenticity scale and discuss the implications of your score to your personal life—particularly about how this scale contributes to your self knowledge.\nRead the attached article and share your reaction towards the main points raised by the author\n\nShould people strive for authenticity?\nDo you think authenticity is achievable?\n\n\nSubmit your reflection paper in any of these formats: .doc, .docx., .pdf\n\nTest Results\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1234567Does not describe me at allDescribes me perfectly\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nScoreThought61. I think it is better to be yourself, than to be popular72. I don’t know how I really feel inside63. I am strongly influenced by the opinions of others44. I usually do what other people tell me to do65. I always feel I need to do what others expect me to do66. Other people influence me greatly77. I feel as if I don’t know myself very well38. I always stand by what I believe in29. I am true to myself in most situations610. I feel out of touch with the real me311. I live in accordance with my values and beliefs512. I feel alienated from myself\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubscaleMy TotalSelf-Alienation19Authentic Living14Accepting External Influence22\nThe Limits of Authenticity\nNotable Points\nCommon view\n\nCommon view of being authentic\n\nBeing true and honest with oneself and others\nHaving a credibility in one’s words and behavior\n\n\nBeing authentic entails:\n\nfreedom\ndiscovery of the truth\nfulfillment in life.\n\n\nThe unique nature of each individual is best seen not in who he is, but in who he becomes, and becoming authentic is a continuous process, not an event.\nIt involves not just knowing oneself, but also recognizing others and the mutual influence between individuals\n\nPhilosopher’s Views\n\nJean-Jacques Rousseau (1712-78) argued that\n\nour personal authenticity is diminished because of our need to respect others due to societies that emphasizes hierarchy, inequality, and interdependence.\nauthenticity is derived from the natural self, whereas inauthenticity is a result of external influences.\n\n\nMartin Heidegger (1889-1976) claims that\n\none can only truly be authentic by being conscious of their inevitable death\nauthenticity and inauthenticity are basic forms of being in the world, thereby being inseparable from each other; they are complementary and interdependent\n\n\nJean-Paul Sartre (1905-80) contends that\n\nthere is no such thing us inherent traits: we have comple control of our nature and decisions (basically implying that free will exists). 1\nauthenticity requires taking full responsibility for our life, choices and actions. Therefore, the anxiety or ‘angst’ which results from our realization of our own inescapable freedom is an integral part of authentic living.\nit should be emphasized that the individual’s freedom is constrained by nature and society, as well as by their own limitations – what Sartre called their ‘facticity’.\n\n\nAlbert Camus (1913-60) states that\n\nTo be authentic, one must be aware of the absurdity of a world with no objective morality and purpose, and create meaning in life through rebellion against the absurdity\n\n\n\nQualifications for the Concept of Authenticity\n\nAuthenticity can never be absolute, thereby the search for its absolute version is a fruitless endeavor.\n\nThe self is always changing so absolute authenticity can only last shortly\nAttaining authenticity involves continuous re-evaluation of of ideals and principles through self-examination and social-interaction\n\n\nIf authenticity is advertised, then it is a mere display of it, instead of a genuine one\nIt is not ideal to display one’s true feelings in some circumstances; thus, it is important to distinguish between internal vs external authenticity\nOther important components necessary for authenticity require the capacity for the following:\n\nunbiased self-examination resulting to accurate self-knowledge\nreflective judgement\npersonal responsibility\nhumility\nempathy for others\nwillingness to listen to criticism\n\n\nAuthenticity is made complicated by the presence of\n\nillusions\nbiases\nand wishful thinking\n\n\n\nParadoxes of Authenticity\n\nAuthenticity is achieved by immersing in the outside world but not by letting it control you\nAuthenticity can only be achieved by immersing oneself in uncertainty but, at the same time, being uncertain entails that you are also uncertain of your own self.\nObjective self-examination requires no biases despite biases being intrinsic in our nature\nTrue self-knowledge should account for the self-doubt and insecurity that exists after a difficult circumstance\nWe have an inaccurate depiction of authenticity because we are not fully aware of all the facts, resulting to us filling in the gaps with our own thoughts and observed facts\n\nInsights\n\nLearning how to be authentic for the sake of self-fulfillment is an individualist and ego-based goal—as opposed to learning it to understand how your authenticity affects others, which is a more altruistic goal\nAuthenticity comes from within; whereas, inauthenticity comes from exposure to our social and cultural environment\nAuthenticity exists because inauthenticity exists, just like how darkness can’t exist without light and vice versa (authenticity and inauthenticity are mutually dependent concepts)\nPersonal authenticity is always changing and is never fixed (there is no core-self)\nAuthenticity is a human construct\nAuthenticity is not fixed and absolute. It is a continuous process that develops through experience (with inter- and intra- personal criticism). Authenticity can only be partial, especially because our self-knowledge will never be complete due to the limits of what our conscious mind knows.\n\nWe interpret our interpretations of reality instead of directly interpreting reality itself. Our understanding of our experiences keeps getting changed as new information arrives.\n\n\nFinding oneself is difficult because of the possession of multiple identities depending on the role they have to play in society—social, cultural, political, national, and religious.\nOur thoughts are restricted by our language, and that language itself does not accurately correspond with our experiences, often being ambiguous.\nThe value of authenticity is understanding your self-development and not your self, because the self is constantly changing so it is something we’ll never truly understand.\nInauthentic compromise and conformity to expectations occurs hindering one’s capacity to understand authenticity\nHiding vulnerabilities diminish authenticity\nTechnology blurs the line between reality and deceiving representations of reality\nWe never approach self-authenticity, we can only get close to it\n\nEssay Response Outline\n\nWhat is the implication of the authenticity scale results to your personal life and self-knowledge?\n\n\nI am alienated from my true self\nI am inauthentic\nI am heavily influenced by the expectations of others\n\n\nShould people strive for authenticity?\n\n\nYes because\n\nit leads to freedom\nit creates meaning in life\nit improves growth, makes life fulfilling, and also helps others\n\n\n\n\nDo you think authenticity is achievable?\n\n\nAbsolute authenticity is impossible because of\n\nlimitations of knowledge\nlimitations of language\nplurality of identity\nthe need to conform to social expectations\ntechnology\nevolution of self\n\n\n\nFootnotes\n\n\nMental illness exists? how can we say they are completely free? ↩\n\n\n"},"index":{"title":"About","links":["Blog/","Research/","School/","School/Assignment-Preparation/"],"tags":[],"content":"Welcome\nHi! This is Faisal Tamano Jr.‘s Notes.\nI’ll be keeping notes I want to publish online here.\n\n\n                  \n                  Tip\n                  \n                \nTo search content by tags, you can either press ⌘/ctrl + shift + K or start your query with #\n\nRelated Links\n\nClass Notes\nFlashcards\n\nFolders\n\nBlog\nResearch\nSchool\n\nAssignment Preparation\n\n\n"}}