{"Journal/software_recommendations":{"title":"Software Recommendations","links":[],"tags":["Software"],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNamePurposeObsidianNote-takingdigiKamPhoto managementyt-dlpYouTube downloaderAnkiSpaced repetition or flashcardsZoteroCitations managerSuper ProductivityTime-tracking softwareBitwardenPassword managementSyncthingFile synchronizationJellyfinMedia serverqBittorrentTorrentingLogseqOutlinerVeraCryptDisk encryption"},"Research/minimum_wage_in_the_philippines":{"title":"Minimum Wage in the Philippines","links":[],"tags":["Economy"],"content":"\n\n                  \n                  Warning\n                  \n                \nThis is temporarily abandoned.\nWill add more info when I need to write more papers about it.\n\nSources\n\n\nCordero, T. (2024, April 12). Current minimum wage still not enough to meet family needs—IBON. GMA News. www.gmanetwork.com/news/money/economy/903491/current-minimum-wage-still-not-enough-to-meet-family-needs-ibon/story/\n\n\nHa, C. (2024, January 23). Minimum wage in the Philippines not sufficient for employees. hrmasia. hrmasia.com/minimum-wage-in-the-philippines-not-meeting-basic-needs/\n\n\nBackground\n\nAs of March 2024, IBON Foundation claims that the national average daily minimum wage (440 PHP) is not enough to cover food and non-food costs of the typical family of five’s needs\n\nthe family living wage—computed using the National Wages and Productivity Commission’s (NWPC) minimum wage data and March 2024 inflation data from the Philippine Statistics Authority—averaged at P1,207, resulting in a national wage gap of P762.\n\n\nAn analysis from Picodi Philippines found that the minimum wage in the country fails to keep up with the rising food prices, suggesting that some Filipinos may not be able to live off the amount earned from work.\n"},"School/2024_dlsu_medical_requirements":{"title":"2024 DLSU Medical Requirements","links":[],"tags":[],"content":"Drug Testing\n\n\n                  \n                  Info\n                  \n                \nDetailed process\n\n\n\n                  \n                  Steps \n                  \n                \n\nSecure and verify the drug testing consent form (if not yet submitted).\nSchedule an appointment through MLS.\nCheck if you received a confirmation email.\nPresent an ID and a screenshot of the confirmation email onsite during the appointment.\n\n\nConsent Form Verification Dates\n\nJune 13\nJune 14\nJune 18\nJune 19\n\nAppointment Date\n02-17 July 2024\nResults\nResults will be released at the Health Services Office (HSO) Enrique Razon Sports Center Clinic and shall be made available on 04 October 2024. Drug test results not claimed by 04 December 2024 shall be forwarded to the drug testing provider’s office where students may claim their results thereafter. The map and address can be viewed here.\nPeriodic Health Examination (PHex)\n\n\n                  \n                  Info\n                  \n                \nDetailed process\n\n\n\n                  \n                  Steps \n                  \n                \n\nDownload the forms.\nChoose an accredited clinic.\nPresent the form to the clinic.\nSubmit the filled-out forms at Waldo Perfecto Seminar Room, Ground Floor, Br. Connon Hall, Monday to Saturday, from 8:00 am to 4:00 pm—no later than 27 July 2024.\n\n\nForms to Print\n\nMedical examination form\nDental examination form\n"},"index":{"title":"About","links":["Journal/","Research/","School/"],"tags":[],"content":"Welcome\nHi! This is Faisal Tamano Jr.‘s Notes.\nI’ll be keeping notes I want to publish online here.\n\n\n                  \n                  Tip\n                  \n                \nTo search content by tags, you can either press ⌘/ctrl + shift + K or start your query with #\n\nRelated Links\n\nClass Notes\nFlashcards\n\nFolders\n\nJournal\nResearch\nSchool\n"}}