[
  "obsidian-annotator",
  "obsidian-charts",
  "obsidian-spaced-repetition",
  "obsidian-day-planner",
  "obsidian-excalidraw-plugin",
  "obsidian-timeline",
  "image-converter",
  "obsidian-image-toolkit",
  "obsidian-latex-suite",
  "obsidian-linter",
  "obsidian-outliner",
  "obsidian-smart-typography",
  "tag-wrangler",
  "click-clack"
]